# StructuralElevationAtTopSurvey Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralElevationAtTopSurvey Property
ParameterTypeId Class See Also
---
"Elevation at Top Survey"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralElevationAtTopSurvey { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralElevationAtTopSurvey As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralElevationAtTopSurvey {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace